Tekla Open API Reference for Tekla Structures 2025
WpfComponentCatalog Class
 The WpfComponentCatalog class represents a group of controls to select components using the component catalog.
 WpfComponentCatalog
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfComponentCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfComponentCatalog : UserControl,
	IComponentConnector
Public Class WpfComponentCatalog
	Inherits UserControl
	Implements IComponentConnector
The WpfComponentCatalog type exposes the following members.
Constructors
Name | Description
WpfComponentCatalog
 Initializes a new instance of the WpfComponentCatalog class.
Top
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedName
 Gets or sets the selected component name in the control.
SelectedNumber
 Gets or sets the selected component number in the control.
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace